function planetHandler(planetName) {
    document.getElementById("contentContainer").style.display = 'flex'

    let bgURL = "planets/";
    let topText;
    let bottomText;

    switch (planetName) {
        case "mercury":
            topText = `Нарнаас: 57.91 сая км <br/>  Диаметр: 4,880 км <br/>
            Дундаж температур: -173 °C-аас 427 °C хүртэл <br/>
            Эзлэхүүн: 6.083x10^10 км^3 <br/>
            Масс: 3.3022x10^23 кг <br/>
            Экваторын гадаргуугийн таталцал: 3.7 м/с^2 <br/>
            Сар: Байхгүй <br/>`;
            bottomText = `Буд гариг нь эртний Грекчүүдийн үеэс хүмүүс мэддэг байсан бөгөөд түүнийг элч бурхан Гермесийн нэрээр нэрлэжээ. 20-р зуунд сансрын хөлгүүд Буд гаригийг ойроос үзэж, судлах боломжтой болсон. Буд гариг нь наранд хамгийн ойр байдаг гариг бөгөөд нарны аймгийн хамгийн жижиг гариг юм.`;
            bgURL += "mercury.png";
                break;
        case "venus":
            topText = `Нарнаас хол зай: 108.2 сая км <br/>
            Диаметр: 12,104 км <br/>
            Дундаж температур: 462 °C <br/>
            Сар: Байхгүй <br/>
            Сонирхолтой баримт: Сугар гариг нь дулааныг барьдаг нүүрстөрөгчийн давхар ислийн зузаан уур амьсгалаараа манай нарны аймгийн хамгийн халуун гариг юм. <br/>`;
            bottomText = "Сугар гаригийг эрт дээр үеэс мэддэг байсан бөгөөд Ромын хайр ба гоо үзэсгэлэнгийн дарь эхийн нэрээр нэрлэгдсэн. 20-р зуунд Сугар гаригийн агаар мандал, гадаргууг судлахын тулд сансрын хөлөг илгээж байжээ.";
            bgURL += "venus.png";
            break;
        case "earth":
            topText = `Нарнаас хол зай: 149.6 сая км <br/>
            Диаметр: 12,742 км <br/>
            Дундаж температур: 14 °C <br/>
            Сар: 1 (Сар) <br/>
            Сонирхолтой баримт: Дэлхий бол манай нарны аймгийн цорын ганц амьдралтай гариг юм. <br/>`;
            bottomText = "Дэлхийг бид оршин тогтносноос хойш мэддэг. Харин 20-р зуунд шинжлэх ухааны аргаар уг гарагийг гүнзгий судалж эхэлсэн.";
            bgURL += "earth.png";
            break;
        case "mars":
            topText = `Нарнаас хол зай: 227.9 сая км <br/>
            Диаметр: 6,779 км <br/>
            Дундаж температур: -87 хэмээс -5 хэм хүртэл <br/>
            Сар: 2 (Фобос ба Деймос) <br/>
            Сонирхолтой баримт: Ангараг гаригт нарны аймгийн хамгийн том галт уул болох Олимп Монс, мөн хамгийн гүн хавцал болох Валлес Маринерис байдаг. <br/>`;
            bottomText = "Ангараг гарагийг хүн төрөлхтөн олон мянган жилийн өмнөөс мэддэг байсан ба Ромын дайны бурхны нэрээр нэрлэсэн. 20-р зуунд Ангараг гараг руу сансрын хөлөг илгээж, түүний гадаргуу, агаар мандал, өнгөрсөн болон одоо байгаа амьдралын шинж тэмдгүүдийг судалсан байдаг.";
            bgURL += "mars.png";
            break;
        case "jupiter":
            topText = `Нарнаас хол зай: 778.5 сая км <br/>
            Диаметр: 139,822 км <br/>
            Дундаж температур: -145 °C <br/>
            Сар: 79 (Галилийн дөрвөн том сарыг оруулаад: Ио, Европ, Ганимед, Каллисто) <br/>
            Сонирхолтой баримт: Бархасбадь бол манай нарны аймгийн хамгийн том гараг бөгөөд нарны салхины тоосонцорыг барьж, хүчтэй цацрагийн бүс үүсгэдэг хүчтэй соронзон оронтой гариг юм. <br/>`;
            bottomText = "Бархасбадь гарагийг эрт дээр үеэс мэддэг байсан бөгөөд Ромын домог зүйд бурхдын хааны нэрээр нэрлэгдсэн байдаг. 20-р зуунд Бархасбадь гаригт агаар мандал, соронзон орон болон дагуулыг нь судлахаар сансрын хөлөг илгээсэн.";
            bgURL += "jupiter.png";
            break;
        case "saturn":
            topText = `Нарнаас хол зай: 1.43 тэрбум км <br/>
            Диаметр: 116,460 км <br/>
            Дундаж температур: -178 °C <br/>
            Сар: 82 (хамгийн том нь Титан) <br/>
            Сонирхолтой баримт: Санчир гариг нь мөс болон түүний хог хаягдлаас тогтсон үзэсгэлэнтэй цагиргуудаараа алдартай. <br/>`;
            bottomText = "Санчир гаригийг хүн төрөлхтөн эрт дээр үеэс мэддэг байсан ба Ромын газар тариалангийн бурхны нэрээр нэрлэжээ. 20-р зуунд Санчир гаригийн цагираг, агаар мандал, сарыг судлахын тулд сансрын хөлөг илгээж байсан.";
            bgURL += "saturn.png";
            break;
        case "uranus":
            topText = `Нарнаас хол зай: 2.87 тэрбум км <br/>
            Диаметр: 50,724 км <br/>
            Дундаж температур: -197 °C <br/>
            Сар: 27 <br/>
            Сонирхолтой баримт: Тэнгэрийн ван гариг нь түүхийн эхэн үед ямар нэг том биеттэй мөргөлдсөний улмаас хажуу тийшээ эргэлддэг болсон. <br/>`;
            bottomText = "Тэнгэрийн ваныг 1781 онд Британийн одон орон судлаач Уильям Хершель нээжээ. Энэ бол дурангаар нээсэн анхны гариг юм. 20-р зуунд Тэнгэрийн ван гариг руу сансрын хөлөг илгээж, түүний агаар мандал, сарыг судалжээ.";
            bgURL += "uranus.png";
            break;
        case "neptune":
            topText = `Нарнаас хол зай: 4.5 тэрбум км <br/>
            Диаметр: 49,244 км <br/>
            Дундаж температур: -201°C <br/>
            Сар: 14 (хамгийн том нь Тритон гэж нэрлэгддэг) <br/>
            Сонирхолтой баримт: Далай ван бол манай нарны аймгийн хамгийн их салхитай гариг бөгөөд салхины хурд 2100 км/цаг хүрдэг. <br/>`;
            bottomText = "Далай ваныг 1846 онд Францын математикч Урбайн Ле Верьер, Британийн одон орон судлаач Жон Куш Адамс нар нээжээ. Энэ бол ажиглалтын аргаар бус математик тооцоогоор нээсэн анхны гараг юм. 20-р зуунд Нептун гариг руу сансрын хөлөг илгээж, түүний агаар мандал, сарыг судлак байжээ.";
            bgURL += "neptune.png";
            break;
    }
    document.getElementById("topText").innerHTML = topText;
    document.getElementById("bottomText").innerHTML = bottomText;
    document.getElementById("pictureDiv").style.backgroundImage = `url("${bgURL}")`;
}

function clearPlanets() {
    document.getElementById("contentContainer").style.display = 'none';
}

document.addEventListener('keydown', function(event) {
    var camera = document.querySelector('a-entity[camera]');
    var currentPosition = camera.getAttribute('position');
    if (event.key === ' ') {
        camera.setAttribute('position', {
            x: currentPosition.x,
            y: currentPosition.y + 2,
            z: currentPosition.z
        });
    }
    if(event.key === 'Shift') {
        camera.setAttribute('position', {
            x: currentPosition.x,
            y: currentPosition.y - 20,
            z: currentPosition.z
        });
    }
    if(event.key === '=') {
        const earth = document.querySelector('#earth');
        let incrementedRadius = earth.getAttribute('radius');
        incrementedRadius++;
        earth.setAttribute('radius', incrementedRadius);
    }
});